In [12]:
import pymysql
import pandas as pd
# MySQL 서버에 연결
con = pymysql.connect(host='localhost', user='root', password='1234',  db='my_db',
 charset='utf8') # 한글처리 (charset = 'utf8’)
# 커서 생성
cursor = con.cursor()

In [8]:
# 쿼리 실행 예시
sql_query = """SELECT e.ename AS 사원이름, 
            d.dname AS 소속부서이름, 
            e.sal AS 급여, 
            e.job AS 직무
        FROM emp e
        JOIN dept d ON e.deptno = d.deptno;"""

cursor.execute(sql_query)
# 쿼리 결과 가져오기
result = cursor.fetchall()
# 결과 출력
for row in result:
 print(row)

('CLARK', 'ACCOUNTING', Decimal('2450.00'), 'MANAGER')
('KING', 'ACCOUNTING', Decimal('5000.00'), 'PRESIDENT')
('MILLER', 'ACCOUNTING', Decimal('1300.00'), 'CLERK')
('SMITH', 'RESEARCH', Decimal('800.00'), 'CLERK')
('JONES', 'RESEARCH', Decimal('2975.00'), 'MANAGER')
('SCOTT', 'RESEARCH', Decimal('3000.00'), 'ANALYST')
('ADAMS', 'RESEARCH', Decimal('1100.00'), 'CLERK')
('FORD', 'RESEARCH', Decimal('3000.00'), 'ANALYST')
('ALLEN', 'SALES', Decimal('1600.00'), 'SALESMAN')
('WARD', 'SALES', Decimal('1250.00'), 'SALESMAN')
('MARTIN', 'SALES', Decimal('1250.00'), 'SALESMAN')
('BLAKE', 'SALES', Decimal('2850.00'), 'MANAGER')
('TURNER', 'SALES', Decimal('1500.00'), 'SALESMAN')
('JAMES', 'SALES', Decimal('950.00'), 'CLERK')

In [ ]:
con

In [ ]:
# 쿼리 실행 예시
sql_query = """select ename, sal, job 
from emp;"""

cursor.execute(sql_query)
# 쿼리 결과 가져오기
result = cursor.fetchall()
# 결과 출력
for row in result:
 print(row)

('SMITH', Decimal('800.00'), 'CLERK')
('ALLEN', Decimal('1600.00'), 'SALESMAN')
('WARD', Decimal('1250.00'), 'SALESMAN')
('JONES', Decimal('2975.00'), 'MANAGER')
('MARTIN', Decimal('1250.00'), 'SALESMAN')
('BLAKE', Decimal('2850.00'), 'MANAGER')
('CLARK', Decimal('2450.00'), 'MANAGER')
('SCOTT', Decimal('3000.00'), 'ANALYST')
('KING', Decimal('5000.00'), 'PRESIDENT')
('TURNER', Decimal('1500.00'), 'SALESMAN')
('ADAMS', Decimal('1100.00'), 'CLERK')
('JAMES', Decimal('950.00'), 'CLERK')
('FORD', Decimal('3000.00'), 'ANALYST')
('MILLER', Decimal('1300.00'), 'CLERK')

In [14]:
#sql_query = """select ename, sal, job 
#from emp;"""

sql_query = """select * 
from emp;"""



cursor.execute(sql_query)
# 쿼리 결과 가져오기
result = cursor.fetchall()
df_emp=pd.DataFrame(result)
df_emp

       0       1          2       3           4        5        6   7
0   7369   SMITH      CLERK  7902.0  1980-12-17   800.00     0.00  20
1   7499   ALLEN   SALESMAN  7698.0  1981-02-20  1600.00   300.00  30
2   7521    WARD   SALESMAN  7698.0  1981-02-22  1250.00   500.00  30
3   7566   JONES    MANAGER  7839.0  1981-04-02  2975.00     0.00  20
4   7654  MARTIN   SALESMAN  7698.0  1981-09-28  1250.00  1400.00  30
5   7698   BLAKE    MANAGER  7839.0  1981-05-01  2850.00     0.00  30
6   7782   CLARK    MANAGER  7839.0  1981-06-09  2450.00     0.00  10
7   7788   SCOTT    ANALYST  7566.0  1982-12-09  3000.00     0.00  20
8   7839    KING  PRESIDENT     NaN  1981-11-17  5000.00     0.00  10
9   7844  TURNER   SALESMAN  7698.0  1981-09-08  1500.00     0.00  30
10  7876   ADAMS      CLERK  7788.0  1983-01-12  1100.00     0.00  20
11  7900   JAMES      CLERK  7698.0  1981-12-03   950.00     0.00  30
12  7902    FORD    ANALYST  7566.0  1981-12-03  3000.00     0.00  20
13  7934  MILLER      CLERK  7782.0  1982-01-23  1300.00     0.00  10

In [15]:
# 연결과 커서 닫기
cursor.close()
con.close()

In [16]:
import MySQLdb
# MySQL 서버에 연결   json 파일처럼 딕셔너리로
db_config = {
'host' :'localhost',  # 호스트 이름
'user' : 'root', # MySQL 사용자 이름
'passwd' : '1234', # MySQL 사용자 비밀번호
'db' : 'my_db', # 연결할 데이터베이스 이름
'charset' : 'utf8'
}
print('hello')

hello

In [17]:
try:
    conn = MySQLdb.connect(**db_config) # 커서 생성
    cursor = conn.cursor() # 쿼리 실행 예시
    sql_query = "SELECT * FROM dept"
    cursor.execute(sql_query) # 쿼리 결과 가져오기
    result = cursor.fetchall() # 결과 출력
    for row in result:
        print(row)
except MySQLdb.Error as e:
    print(f"Error: {e}")
finally: # 연결과 커서 닫기
    cursor.close()
    conn.close()

(10, 'ACCOUNTING', 'NEW YORK')
(20, 'RESEARCH', 'DALLAS')
(30, 'SALES', 'CHICAGO')
(40, 'OPERATIONS', 'BOSTON')

In [ ]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine("mysql+pymysql://root:1234@localhost/my_db")
engine #engine이라는 객체생성

Engine(mysql+pymysql://root:***@localhost/my_db)

In [20]:
df = pd.read_sql("SHOW TABLES IN my_db;", engine)
tables = pd.read_sql("SELECT * FROM dept", engine)
print(df)
tables.head()

  Tables_in_my_db
0            dept
1             emp
2        salgrade

   DEPTNO       DNAME       LOC
0      10  ACCOUNTING  NEW YORK
1      20    RESEARCH    DALLAS
2      30       SALES   CHICAGO
3      40  OPERATIONS    BOSTON

In [24]:
from sqlalchemy import create_engine, Column, Integer, String
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker

Base = declarative_base()

class Product(Base):
    __tablename__ = 'products_1'

    id = Column(Integer, primary_key=True, autoincrement=True)
    name = Column(String(100), nullable=False)
    price = Column(Integer, nullable=False)
    stock = Column(Integer, nullable=False)

    def __repr__(self):
        return f"<Product(id={self.id}, name='{self.name}', price={self.price}, stock={self.stock})>"

Base.metadata.create_all(engine)

C:\Users\Admin\AppData\Local\Temp\ipykernel_15432\2954948228.py:5: MovedIn20Warning: The ``declarative_base()`` function is now available as sqlalchemy.orm.declarative_base(). (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  Base = declarative_base()

In [25]:
Session = sessionmaker(bind=engine)
session = Session()

In [36]:
def add_product(name, price, stock):
    new_product = Product(name=name, price=price, stock=stock)
    session.add(new_product)
    session.commit()
    print(f"🆕 '{name}' 상품이 등록되었습니다!")


add_product("롤리팝", 500, 10)
add_product("핫초코", 2000, 10)

🆕 '롤리팝' 상품이 등록되었습니다!
🆕 '핫초코' 상품이 등록되었습니다!

In [37]:
def list_products():
    products = session.query(Product).all() #select
    for p in products:
        print(p)

list_products()

<Product(id=3, name='롤리팝', price=500, stock=10)>
<Product(id=4, name='핫초코', price=2000, stock=10)>

In [30]:
def update_price(product_id, new_price):
    product = session.query(Product).get(product_id)
    if product:
        product.price = new_price
        session.commit()
        print(f"💸 {product.name}의 가격이 {new_price}원으로 변경되었습니다.")
    else:
        print("❌ 해당 상품이 존재하지 않습니다.")

update_price(2, 3000)

💸 핫초코의 가격이 3000원으로 변경되었습니다.

C:\Users\Admin\AppData\Local\Temp\ipykernel_15432\4289321564.py:2: LegacyAPIWarning: The Query.get() method is considered legacy as of the 1.x series of SQLAlchemy and becomes a legacy construct in 2.0. The method is now available as Session.get() (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  product = session.query(Product).get(product_id)

In [34]:
def delete_product(product_id):
    product = session.query(Product).get(product_id)
    if product:
        session.delete(product)
        session.commit()
        print(f"🗑️ '{product.name}' 상품이 삭제되었습니다.")
    else:
        print("❌ 해당 상품이 존재하지 않습니다.")
        
delete_product(1)

🗑️ '롤리팝' 상품이 삭제되었습니다.

C:\Users\Admin\AppData\Local\Temp\ipykernel_15432\2417250261.py:2: LegacyAPIWarning: The Query.get() method is considered legacy as of the 1.x series of SQLAlchemy and becomes a legacy construct in 2.0. The method is now available as Session.get() (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  product = session.query(Product).get(product_id)

In [38]:
try:
    # 작업
    product = session.query(Product).get(1)
    product.price += 500
    session.commit()
except Exception as e:
    session.rollback()
    print("예외 발생, 롤백:", e)
finally:
    session.close()
    print("세션 종료")

예외 발생, 롤백: 'NoneType' object has no attribute 'price'
세션 종료

C:\Users\Admin\AppData\Local\Temp\ipykernel_15432\1734247740.py:3: LegacyAPIWarning: The Query.get() method is considered legacy as of the 1.x series of SQLAlchemy and becomes a legacy construct in 2.0. The method is now available as Session.get() (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  product = session.query(Product).get(1)